{
    "version": "https://jsonfeed.org/version/1",
    "title": "takyon | BLOG",
    "description": "",
    "home_page_url": "https://takyon12.github.io/gh-pages",
    "feed_url": "https://takyon12.github.io/gh-pages/feed.json",
    "user_comment": "",
    "author": {
        "name": "takyon12"
    },
    "items": [
        {
            "id": "https://takyon12.github.io/gh-pages/empties-0421.html",
            "url": "https://takyon12.github.io/gh-pages/empties-0421.html",
            "title": "EMPTIES - 04/21",
            "summary": "Products I managed to empty during the last month! ",
            "content_html": "<p>Products I managed to empty during the last month! </p>",
            "author": {
                "name": "takyon12"
            },
            "tags": [
                   "SKINCARE",
                   "REVIEW"
            ],
            "date_published": "2021-05-04T18:14:21+02:00",
            "date_modified": "2021-05-04T18:14:30+02:00"
        },
        {
            "id": "https://takyon12.github.io/gh-pages/bird-update.html",
            "url": "https://takyon12.github.io/gh-pages/bird-update.html",
            "title": "Bird update",
            "summary": "Bla bla bla",
            "content_html": "<p>Bla bla bla</p>",
            "image": "https://takyon12.github.io/gh-pages/media/posts/3/sulcinko.png",
            "author": {
                "name": "takyon12"
            },
            "tags": [
                   "BLOG"
            ],
            "date_published": "2021-05-04T17:48:51+02:00",
            "date_modified": "2021-05-04T17:57:59+02:00"
        },
        {
            "id": "https://takyon12.github.io/gh-pages/skincare-at-29.html",
            "url": "https://takyon12.github.io/gh-pages/skincare-at-29.html",
            "title": "Skincare at 29",
            "summary": "Since there are only a few things that I am as sensitive/consistent about as I am about taking care of&hellip;",
            "content_html": "<p>Since there are only a few things that I am as sensitive/consistent about as I am about taking care of my face I thought I might as well write a post about it. Am I vain? No, I wouldn't say so. I'd argue back I'm just very self-conscious (anxious, honestly) about how my face looks like, as a consequence of suffering acne during my teen years. Let's just say my family members weren't always tactful in their \"kind\" remarks about how I look, lol.</p>\n<p>Yeah and since I'm (long) not a teen anymore I also kinda try to target ageing with my skincare. I mean you're stuck in your skin for the rest of your life literally so why not try to make yourself look good while you still can? It's always cheaper to prevent the damage than it is to repair it later with expensive procedures. Fyi I'm gonna be 30 soon, I'd say if you're 25-30 it's prob high time to start.</p>\n<p>So. I am in <strong>no way</strong> perfect today but I think consistency pays off, guys. The best thing is, you don't really need a salary of a Hollywood star and attending elaborate cosmetic procedures in order to look decent. Nope. You only need to have a handful of basic knowledge about how your skin works and try putting that to use.</p>\n<p>Since there really is a vast number of beauty blogs and similar stuff out there today I'm gonna reduce this post to a bunch of cosmetic products I think are essential, sort of, and you could find them useful for yourself too. So, here we go.</p>\n<p><strong>1. CHEAP double cleanse (in the evening)</strong><br>Getting your face clean in the evening is crucial but you don't need to spend a fortune in order to do it thoroughly. Use a combination of a cheap emulsifying drugstore cleansing oil and a non stripping gel cleanser (that doesn't contain any SLS - sodium laureth sulfate). I usually use drugstore baby shower gel since those are both gentle and cheap.</p>\n<p>In the morning one step cleansing (with gel) in the morning. If you're especially dry maybe you'll get away with washing your face just with water, who knows? </p>\n<p><strong>2. Effective retinoids (evening only)</strong><br>I'm talking both topical and systemic. Systemic are usually more effective for treating acne since you usually only need to take them temporarily for getting rid of acne for good. I did a round of taking microdose of isotretinoin (Roacutanne) in summer 2020 and the acne still has't come back although it can happen you'd need to do more rounds. </p>\n<p>Topical retinoids (tretoinic acid/tretinoin) are effective both for photoaging and acne but you need to use them regularly. If you're using it for acne it's likely your acne will come back if you stop using topical tretinoin. If you're using it for photoaging you need to use it regularly too. There's no cumulative effect with tretinoin.</p>\n<p>As for availability - you need prescription for both of them since they are pretty serious drugs. Isotretinoin tends to be super cheap depending on your medical insurance. Tretinoin varies in price, in some european countries it's unavailable so you'll need to look for it online/travel and can get quite expensive (80$ per tube or so). Fyi 1)there are also online derm appointments and 2) photoaging is a valid reason for prescription, use that to your advantage.</p>\n<p>Which one? Well, the plain old tretinoin is gold standard, def try to use that (Retin-A, A-Ret, Renova, Acretin, Airol, ...) if you can't get that then use Differin (OTC in the US) or retinAl (Geek&amp;Gorgeous A-Game is super cheap and it's literally the same as Medik8 Crystal Retinal, don't get fooled and robbed). RetinOl is weak.</p>\n<p><strong>3. Effective exfoliants (in the evening)</strong><br>Acids help remove dead skin cells thus making you appear younger and also helping other products you put on your face penetrate better. In general: use alpha hydroxy acids if your skin is dry, beta hydroxy acids if you're oily and have acne and use poly hydroxy acids if you're extra sensitive. You can use PHA daily since they are usually super gentle, otherwise if you use AHA/BHA I'd start 1-2x a week and then see how your face reacts. Which one? I recently bought BR P50 (dubbed 'Jesus in a bottle'), I love it.</p>\n<p><strong>4. SPF (in the morning)</strong><br>Non negotiable! Sun exposure = aging and it also can worsen your acne since it oxidizes sebum on your skin. You should SPF50 especially if you use retinoids and acids, but really, using any SPF is far better than using none. Which one? I'd personally use pharmacy brands since I think theyr'e the most reliable. You can also check some on consumerreports.org and see if they deliver. </p>\n<p>Of course you can use other products. I do, a ton of other products. I just consider these to be essential, e.g. they are proven to work and are usually not a waste of your money. Depending what you actually purchase 😉</p>\n<p>Any questions? Feel free to ask. Bear in mind I'm not a professional. I'm not even a beauty blogger, just wanted to share with ya. Bye! :)</p>\n<p>PS. Attaching some pics of my face, just for demonstration</p>",
            "image": "https://takyon12.github.io/gh-pages/media/posts/2/14238172_10202421864624350_8187828739843601065_n.jpg",
            "author": {
                "name": "takyon12"
            },
            "tags": [
                   "SKINCARE"
            ],
            "date_published": "2021-05-04T17:48:36+02:00",
            "date_modified": "2021-05-04T18:22:49+02:00"
        },
        {
            "id": "https://takyon12.github.io/gh-pages/first-words.html",
            "url": "https://takyon12.github.io/gh-pages/first-words.html",
            "title": "First words",
            "summary": "XSAJKDHSAKJDASDFSDFDSFDSF HSAKJDASDFSDFD HSAKJDASDFSDFD XSAJKDHSAKJDASDFSDFDSFDSF HSAKJDASDFSDFD HSAKJDASDFSDFD XSAJKDHSAKJDASDFSDFDSFDSF HSAKJDASDFSDFD HSAKJDASDFSDFD ",
            "content_html": "<p>XSAJKDHSAKJDASDFSDFDSFDSF HSAKJDASDFSDFD HSAKJDASDFSDFD XSAJKDHSAKJDASDFSDFDSFDSF HSAKJDASDFSDFD HSAKJDASDFSDFD XSAJKDHSAKJDASDFSDFDSFDSF HSAKJDASDFSDFD HSAKJDASDFSDFD</p>\n<p> </p>\n<figure class=\"post__image\"><img loading=\"lazy\"  src=\"https://takyon12.github.io/gh-pages/media/posts/1/arwen.JPG\" sizes=\"(max-width: 48em) 100vw, 100vw\" srcset=\"https://takyon12.github.io/gh-pages/media/posts/1/responsive/arwen-xs.JPG 300w ,https://takyon12.github.io/gh-pages/media/posts/1/responsive/arwen-sm.JPG 480w ,https://takyon12.github.io/gh-pages/media/posts/1/responsive/arwen-md.JPG 768w\"  alt=\"\" width=\"780\" height=\"520\"></figure>",
            "image": "https://takyon12.github.io/gh-pages/media/posts/1/7C89729F-77A6-4771-A86E-DD5BB3043C98.jpg",
            "author": {
                "name": "takyon12"
            },
            "tags": [
                   "BLOG"
            ],
            "date_published": "2021-05-04T17:48:16+02:00",
            "date_modified": "2021-05-04T17:57:53+02:00"
        }
    ]
}
